# 89. 格雷编码
#
# 格雷编码是一个二进制数字系统，在该系统中，两个连续的数值仅有一个位数的差异。 
# 
#  给定一个代表编码总位数的非负整数 n，打印其格雷编码序列。即使有多个不同答案，你也只需要返回其中一种。 
# 
#  格雷编码序列必须以 0 开头。 
# 
#  
# 
#  示例 1: 
# 
#  输入: 2
# 输出: [0,1,3,2]
# 解释:
# 00 - 0
# 01 - 1
# 11 - 3
# 10 - 2
# 
# 对于给定的 n，其格雷编码序列并不唯一。
# 例如，[0,2,3,1] 也是一个有效的格雷编码序列。
# 
# 00 - 0
# 10 - 2
# 11 - 3
# 01 - 1 
# 
#  示例 2: 
# 
#  输入: 0
# 输出: [0]
# 解释: 我们定义格雷编码序列必须以 0 开头。
#      给定编码总位数为 n 的格雷编码序列，其长度为 2n。当 n = 0 时，长度为 20 = 1。
#      因此，当 n = 0 时，其格雷编码序列为 [0]。
#  
#  Related Topics 回溯算法 
#  👍 249 👎 0


"""
解:
1.首先从2位bit的值列变成3位bit的值列,包含两类情况
    00,01,11,10 ->
        000,001,011,010
        100,101,111,110
    即
    0,1,3,2 ->
        0,1,3,2
        4,5,7,6
    原列表+(原列表值均+2^(n-1))
2.由于格雷编码重点在于顺序的有且仅有1位bit变化,
则"+1"的新列表不应该直接拼接,而应该逆序拼接,保证变动位永远仅有"+1"

"""
# leetcode submit region begin(Prohibit modification and deletion)
from copy import copy
class Solution:
    def grayCode(self, n: int) -> List[int]:
        if n == 0:
            return [0]
        results = [0]

        # i=0开始生成结果
        # 此时结果为n=1的结果
        for i in range(n):
            base = 2 ** i
            # 此处注意是副本
            result = copy(results)
            # 注意逆序保证在数字在二进制上仅变动一位
            for index in range(len(result)-1,-1,-1):
                # 增加一个k位二进制数中头部1的效果等价于增加2的k-1次方
                results.append(result[index] + base)
        return results
# leetcode submit region end(Prohibit modification and deletion)
